NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series1/EFM32GG11B/EFM32GG11B110F2048IQ64.svd
        <register>
          <name>DTCTRL</name>
          <description>DTI Control Register</description>
          <addressOffset>0x0A0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x010007FF</resetMask>
          <fields>
            <field>
              <name>DTEN</name>
              <description>DTI Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTDAS</name>
              <description>DTI Automatic Start-up Functionality</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTIPOL</name>
              <description>DTI Inactive Polarity</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTCINV</name>
              <description>DTI Complementary Output Invert</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTPRSSEL</name>
              <description>DTI PRS Source Channel Select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PRSCH0</name>
                  <description>PRS Channel 0 selected as input</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH1</name>
                  <description>PRS Channel 1 selected as input</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH2</name>
                  <description>PRS Channel 2 selected as input</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH3</name>
                  <description>PRS Channel 3 selected as input</description>
                  <value>0x00000003</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH4</name>
                  <description>PRS Channel 4 selected as input</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH5</name>
                  <description>PRS Channel 5 selected as input</description>
                  <value>0x00000005</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH6</name>
                  <description>PRS Channel 6 selected as input</description>
                  <value>0x00000006</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH7</name>
                  <description>PRS Channel 7 selected as input</description>
                  <value>0x00000007</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH8</name>
                  <description>PRS Channel 8 selected as input</description>
                  <value>0x00000008</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH9</name>
                  <description>PRS Channel 9 selected as input</description>
                  <value>0x00000009</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH10</name>
                  <description>PRS Channel 10 selected as input</description>
                  <value>0x0000000A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH11</name>
                  <description>PRS Channel 11 selected as input</description>
                  <value>0x0000000B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH12</name>
                  <description>PRS Channel 12 selected as input</description>
                  <value>0x0000000C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH13</name>
                  <description>PRS Channel 13 selected as input</description>
                  <value>0x0000000D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH14</name>
                  <description>PRS Channel 14 selected as input</description>
                  <value>0x0000000E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH15</name>
                  <description>PRS Channel 15 selected as input</description>
                  <value>0x0000000F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH16</name>
                  <description>PRS Channel 16 selected as input</description>
                  <value>0x00000010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH17</name>
                  <description>PRS Channel 17 selected as input</description>
                  <value>0x00000011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH18</name>
                  <description>PRS Channel 18 selected as input</description>
                  <value>0x00000012</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH19</name>
                  <description>PRS Channel 19 selected as input</description>
                  <value>0x00000013</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH20</name>
                  <description>PRS Channel 20 selected as input</description>
                  <value>0x00000014</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH21</name>
                  <description>PRS Channel 21 selected as input</description>
                  <value>0x00000015</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH22</name>
                  <description>PRS Channel 22 selected as input</description>
                  <value>0x00000016</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCH23</name>
                  <description>PRS Channel 23 selected as input</description>
                  <value>0x00000017</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DTAR</name>
              <description>DTI Always Run</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTFATS</name>
              <description>DTI Fault Action on Timer Stop</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTPRSEN</name>
              <description>DTI PRS Source Enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DTTIME</name>
          <description>DTI Time Control Register</description>
          <addressOffset>0x0A4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x003F3F0F</resetMask>
          <fields>
            <field>
              <name>DTPRESC</name>
              <description>DTI Prescaler Setting</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV1</name>
                  <description>The HFPERCLK is undivided</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV2</name>
                  <description>The HFPERCLK is divided by 2</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV4</name>
                  <description>The HFPERCLK is divided by 4</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV8</name>
                  <description>The HFPERCLK is divided by 8</description>
                  <value>0x00000003</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV16</name>
                  <description>The HFPERCLK is divided by 16</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV32</name>
                  <description>The HFPERCLK is divided by 32</description>
                  <value>0x00000005</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV64</name>
                  <description>The HFPERCLK is divided by 64</description>
                  <value>0x00000006</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV128</name>
                  <description>The HFPERCLK is divided by 128</description>
                  <value>0x00000007</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV256</name>
                  <description>The HFPERCLK is divided by 256</description>
                  <value>0x00000008</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV512</name>
                  <description>The HFPERCLK is divided by 512</description>
                  <value>0x00000009</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV1024</name>
                  <description>The HFPERCLK is divided by 1024</description>
                  <value>0x0000000A</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DTRISET</name>
              <description>DTI Rise-time</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTFALLT</name>
              <description>DTI Fall-time</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
